espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_adc_reg.h
/**
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** RTCADC_READER1_CTRL_REG register
 *  Control the read operation of ADC1.
 */
#define RTCADC_READER1_CTRL_REG (DR_REG_LP_ADC_BASE + 0x0)
/** RTCADC_SAR1_CLK_DIV : R/W; bitpos: [7:0]; default: 2;
 *  Clock divider.
 */
#define RTCADC_SAR1_CLK_DIV    0x000000FFU
#define RTCADC_SAR1_CLK_DIV_M  (RTCADC_SAR1_CLK_DIV_V << RTCADC_SAR1_CLK_DIV_S)
#define RTCADC_SAR1_CLK_DIV_V  0x000000FFU
#define RTCADC_SAR1_CLK_DIV_S  0
/** RTCADC_SAR1_DATA_INV : R/W; bitpos: [28]; default: 0;
 *  Invert SAR ADC1 data.
 */
#define RTCADC_SAR1_DATA_INV    (BIT(28))
#define RTCADC_SAR1_DATA_INV_M  (RTCADC_SAR1_DATA_INV_V << RTCADC_SAR1_DATA_INV_S)
#define RTCADC_SAR1_DATA_INV_V  0x00000001U
#define RTCADC_SAR1_DATA_INV_S  28
/** RTCADC_SAR1_INT_EN : R/W; bitpos: [29]; default: 1;
 *  Enable saradc1 to send out interrupt.
 */
#define RTCADC_SAR1_INT_EN    (BIT(29))
#define RTCADC_SAR1_INT_EN_M  (RTCADC_SAR1_INT_EN_V << RTCADC_SAR1_INT_EN_S)
#define RTCADC_SAR1_INT_EN_V  0x00000001U
#define RTCADC_SAR1_INT_EN_S  29
/** RTCADC_SAR1_EN_PAD_FORCE_ENABLE : R/W; bitpos: [31:30]; default: 0;
 *  Force enable adc en_pad to analog circuit 2'b11: force enable .
 */
#define RTCADC_SAR1_EN_PAD_FORCE_ENABLE    0x00000003U
#define RTCADC_SAR1_EN_PAD_FORCE_ENABLE_M  (RTCADC_SAR1_EN_PAD_FORCE_ENABLE_V << RTCADC_SAR1_EN_PAD_FORCE_ENABLE_S)
#define RTCADC_SAR1_EN_PAD_FORCE_ENABLE_V  0x00000003U
#define RTCADC_SAR1_EN_PAD_FORCE_ENABLE_S  30

/** RTCADC_MEAS1_CTRL2_REG register
 *  ADC1 configuration registers.
 */
#define RTCADC_MEAS1_CTRL2_REG (DR_REG_LP_ADC_BASE + 0xc)
/** RTCADC_MEAS1_DATA_SAR : RO; bitpos: [15:0]; default: 0;
 *  SAR ADC1 data.
 */
#define RTCADC_MEAS1_DATA_SAR    0x0000FFFFU
#define RTCADC_MEAS1_DATA_SAR_M  (RTCADC_MEAS1_DATA_SAR_V << RTCADC_MEAS1_DATA_SAR_S)
#define RTCADC_MEAS1_DATA_SAR_V  0x0000FFFFU
#define RTCADC_MEAS1_DATA_SAR_S  0
/** RTCADC_MEAS1_DONE_SAR : RO; bitpos: [16]; default: 0;
 *  SAR ADC1 conversion done indication.
 */
#define RTCADC_MEAS1_DONE_SAR    (BIT(16))
#define RTCADC_MEAS1_DONE_SAR_M  (RTCADC_MEAS1_DONE_SAR_V << RTCADC_MEAS1_DONE_SAR_S)
#define RTCADC_MEAS1_DONE_SAR_V  0x00000001U
#define RTCADC_MEAS1_DONE_SAR_S  16
/** RTCADC_MEAS1_START_SAR : R/W; bitpos: [17]; default: 0;
 *  SAR ADC1 controller (in RTC) starts conversion.
 */
#define RTCADC_MEAS1_START_SAR    (BIT(17))
#define RTCADC_MEAS1_START_SAR_M  (RTCADC_MEAS1_START_SAR_V << RTCADC_MEAS1_START_SAR_S)
#define RTCADC_MEAS1_START_SAR_V  0x00000001U
#define RTCADC_MEAS1_START_SAR_S  17
/** RTCADC_MEAS1_START_FORCE : R/W; bitpos: [18]; default: 0;
 *  1: SAR ADC1 controller (in RTC) is started by SW.
 */
#define RTCADC_MEAS1_START_FORCE    (BIT(18))
#define RTCADC_MEAS1_START_FORCE_M  (RTCADC_MEAS1_START_FORCE_V << RTCADC_MEAS1_START_FORCE_S)
#define RTCADC_MEAS1_START_FORCE_V  0x00000001U
#define RTCADC_MEAS1_START_FORCE_S  18
/** RTCADC_SAR1_EN_PAD : R/W; bitpos: [30:19]; default: 0;
 *  SAR ADC1 pad enable bitmap.
 */
#define RTCADC_SAR1_EN_PAD    0x00000FFFU
#define RTCADC_SAR1_EN_PAD_M  (RTCADC_SAR1_EN_PAD_V << RTCADC_SAR1_EN_PAD_S)
#define RTCADC_SAR1_EN_PAD_V  0x00000FFFU
#define RTCADC_SAR1_EN_PAD_S  19
/** RTCADC_SAR1_EN_PAD_FORCE : R/W; bitpos: [31]; default: 0;
 *  1: SAR ADC1 pad enable bitmap is controlled by SW.
 */
#define RTCADC_SAR1_EN_PAD_FORCE    (BIT(31))
#define RTCADC_SAR1_EN_PAD_FORCE_M  (RTCADC_SAR1_EN_PAD_FORCE_V << RTCADC_SAR1_EN_PAD_FORCE_S)
#define RTCADC_SAR1_EN_PAD_FORCE_V  0x00000001U
#define RTCADC_SAR1_EN_PAD_FORCE_S  31

/** RTCADC_MEAS1_MUX_REG register
 *  SAR ADC1 MUX register.
 */
#define RTCADC_MEAS1_MUX_REG (DR_REG_LP_ADC_BASE + 0x10)
/** RTCADC_SAR1_DIG_FORCE : R/W; bitpos: [31]; default: 0;
 *  1: SAR ADC1 controlled by DIG ADC1 CTRL.
 */
#define RTCADC_SAR1_DIG_FORCE    (BIT(31))
#define RTCADC_SAR1_DIG_FORCE_M  (RTCADC_SAR1_DIG_FORCE_V << RTCADC_SAR1_DIG_FORCE_S)
#define RTCADC_SAR1_DIG_FORCE_V  0x00000001U
#define RTCADC_SAR1_DIG_FORCE_S  31

/** RTCADC_ATTEN1_REG register
 *  ADC1 attenuation registers.
 */
#define RTCADC_ATTEN1_REG (DR_REG_LP_ADC_BASE + 0x14)
/** RTCADC_SAR1_ATTEN : R/W; bitpos: [31:0]; default: 4294967295;
 *  2-bit attenuation for each pad.
 */
#define RTCADC_SAR1_ATTEN    0xFFFFFFFFU
#define RTCADC_SAR1_ATTEN_M  (RTCADC_SAR1_ATTEN_V << RTCADC_SAR1_ATTEN_S)
#define RTCADC_SAR1_ATTEN_V  0xFFFFFFFFU
#define RTCADC_SAR1_ATTEN_S  0

/** RTCADC_READER2_CTRL_REG register
 *  Control the read operation of ADC2.
 */
#define RTCADC_READER2_CTRL_REG (DR_REG_LP_ADC_BASE + 0x24)
/** RTCADC_SAR2_CLK_DIV : R/W; bitpos: [7:0]; default: 2;
 *  Clock divider.
 */
#define RTCADC_SAR2_CLK_DIV    0x000000FFU
#define RTCADC_SAR2_CLK_DIV_M  (RTCADC_SAR2_CLK_DIV_V << RTCADC_SAR2_CLK_DIV_S)
#define RTCADC_SAR2_CLK_DIV_V  0x000000FFU
#define RTCADC_SAR2_CLK_DIV_S  0
/** RTCADC_SAR2_WAIT_ARB_CYCLE : R/W; bitpos: [17:16]; default: 1;
 *  Wait arbit stable after sar_done.
 */
#define RTCADC_SAR2_WAIT_ARB_CYCLE    0x00000003U
#define RTCADC_SAR2_WAIT_ARB_CYCLE_M  (RTCADC_SAR2_WAIT_ARB_CYCLE_V << RTCADC_SAR2_WAIT_ARB_CYCLE_S)
#define RTCADC_SAR2_WAIT_ARB_CYCLE_V  0x00000003U
#define RTCADC_SAR2_WAIT_ARB_CYCLE_S  16
/** RTCADC_SAR2_EN_PAD_FORCE_ENABLE : R/W; bitpos: [28:27]; default: 0;
 *  Force enable adc en_pad to analog circuit 2'b11: force enable .
 */
#define RTCADC_SAR2_EN_PAD_FORCE_ENABLE    0x00000003U
#define RTCADC_SAR2_EN_PAD_FORCE_ENABLE_M  (RTCADC_SAR2_EN_PAD_FORCE_ENABLE_V << RTCADC_SAR2_EN_PAD_FORCE_ENABLE_S)
#define RTCADC_SAR2_EN_PAD_FORCE_ENABLE_V  0x00000003U
#define RTCADC_SAR2_EN_PAD_FORCE_ENABLE_S  27
/** RTCADC_SAR2_DATA_INV : R/W; bitpos: [29]; default: 0;
 *  Invert SAR ADC2 data.
 */
#define RTCADC_SAR2_DATA_INV    (BIT(29))
#define RTCADC_SAR2_DATA_INV_M  (RTCADC_SAR2_DATA_INV_V << RTCADC_SAR2_DATA_INV_S)
#define RTCADC_SAR2_DATA_INV_V  0x00000001U
#define RTCADC_SAR2_DATA_INV_S  29
/** RTCADC_SAR2_INT_EN : R/W; bitpos: [30]; default: 1;
 *  Enable saradc2 to send out interrupt.
 */
#define RTCADC_SAR2_INT_EN    (BIT(30))
#define RTCADC_SAR2_INT_EN_M  (RTCADC_SAR2_INT_EN_V << RTCADC_SAR2_INT_EN_S)
#define RTCADC_SAR2_INT_EN_V  0x00000001U
#define RTCADC_SAR2_INT_EN_S  30

