espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_adc_reg.h
/** RTCADC_MEAS2_CTRL1_REG register
 *  ADC2 configuration registers.
 */
#define RTCADC_MEAS2_CTRL1_REG (DR_REG_LP_ADC_BASE + 0x2c)
/** RTCADC_SAR2_CNTL_STATE : RO; bitpos: [2:0]; default: 0;
 *  saradc2_cntl_fsm.
 */
#define RTCADC_SAR2_CNTL_STATE    0x00000007U
#define RTCADC_SAR2_CNTL_STATE_M  (RTCADC_SAR2_CNTL_STATE_V << RTCADC_SAR2_CNTL_STATE_S)
#define RTCADC_SAR2_CNTL_STATE_V  0x00000007U
#define RTCADC_SAR2_CNTL_STATE_S  0
/** RTCADC_SAR2_PWDET_CAL_EN : R/W; bitpos: [3]; default: 0;
 *  RTC control pwdet enable.
 */
#define RTCADC_SAR2_PWDET_CAL_EN    (BIT(3))
#define RTCADC_SAR2_PWDET_CAL_EN_M  (RTCADC_SAR2_PWDET_CAL_EN_V << RTCADC_SAR2_PWDET_CAL_EN_S)
#define RTCADC_SAR2_PWDET_CAL_EN_V  0x00000001U
#define RTCADC_SAR2_PWDET_CAL_EN_S  3
/** RTCADC_SAR2_PKDET_CAL_EN : R/W; bitpos: [4]; default: 0;
 *  RTC control pkdet enable.
 */
#define RTCADC_SAR2_PKDET_CAL_EN    (BIT(4))
#define RTCADC_SAR2_PKDET_CAL_EN_M  (RTCADC_SAR2_PKDET_CAL_EN_V << RTCADC_SAR2_PKDET_CAL_EN_S)
#define RTCADC_SAR2_PKDET_CAL_EN_V  0x00000001U
#define RTCADC_SAR2_PKDET_CAL_EN_S  4
/** RTCADC_SAR2_EN_TEST : R/W; bitpos: [5]; default: 0;
 *  SAR2_EN_TEST.
 */
#define RTCADC_SAR2_EN_TEST    (BIT(5))
#define RTCADC_SAR2_EN_TEST_M  (RTCADC_SAR2_EN_TEST_V << RTCADC_SAR2_EN_TEST_S)
#define RTCADC_SAR2_EN_TEST_V  0x00000001U
#define RTCADC_SAR2_EN_TEST_S  5

/** RTCADC_MEAS2_CTRL2_REG register
 *  ADC2 configuration registers.
 */
#define RTCADC_MEAS2_CTRL2_REG (DR_REG_LP_ADC_BASE + 0x30)
/** RTCADC_MEAS2_DATA_SAR : RO; bitpos: [15:0]; default: 0;
 *  SAR ADC2 data.
 */
#define RTCADC_MEAS2_DATA_SAR    0x0000FFFFU
#define RTCADC_MEAS2_DATA_SAR_M  (RTCADC_MEAS2_DATA_SAR_V << RTCADC_MEAS2_DATA_SAR_S)
#define RTCADC_MEAS2_DATA_SAR_V  0x0000FFFFU
#define RTCADC_MEAS2_DATA_SAR_S  0
/** RTCADC_MEAS2_DONE_SAR : RO; bitpos: [16]; default: 0;
 *  SAR ADC2 conversion done indication.
 */
#define RTCADC_MEAS2_DONE_SAR    (BIT(16))
#define RTCADC_MEAS2_DONE_SAR_M  (RTCADC_MEAS2_DONE_SAR_V << RTCADC_MEAS2_DONE_SAR_S)
#define RTCADC_MEAS2_DONE_SAR_V  0x00000001U
#define RTCADC_MEAS2_DONE_SAR_S  16
/** RTCADC_MEAS2_START_SAR : R/W; bitpos: [17]; default: 0;
 *  SAR ADC2 controller (in RTC) starts conversion.
 */
#define RTCADC_MEAS2_START_SAR    (BIT(17))
#define RTCADC_MEAS2_START_SAR_M  (RTCADC_MEAS2_START_SAR_V << RTCADC_MEAS2_START_SAR_S)
#define RTCADC_MEAS2_START_SAR_V  0x00000001U
#define RTCADC_MEAS2_START_SAR_S  17
/** RTCADC_MEAS2_START_FORCE : R/W; bitpos: [18]; default: 0;
 *  1: SAR ADC2 controller (in RTC) is started by SW.
 */
#define RTCADC_MEAS2_START_FORCE    (BIT(18))
#define RTCADC_MEAS2_START_FORCE_M  (RTCADC_MEAS2_START_FORCE_V << RTCADC_MEAS2_START_FORCE_S)
#define RTCADC_MEAS2_START_FORCE_V  0x00000001U
#define RTCADC_MEAS2_START_FORCE_S  18
/** RTCADC_SAR2_EN_PAD : R/W; bitpos: [30:19]; default: 0;
 *  SAR ADC2 pad enable bitmap.
 */
#define RTCADC_SAR2_EN_PAD    0x00000FFFU
#define RTCADC_SAR2_EN_PAD_M  (RTCADC_SAR2_EN_PAD_V << RTCADC_SAR2_EN_PAD_S)
#define RTCADC_SAR2_EN_PAD_V  0x00000FFFU
#define RTCADC_SAR2_EN_PAD_S  19
/** RTCADC_SAR2_EN_PAD_FORCE : R/W; bitpos: [31]; default: 0;
 *  1: SAR ADC2 pad enable bitmap is controlled by SW.
 */
#define RTCADC_SAR2_EN_PAD_FORCE    (BIT(31))
#define RTCADC_SAR2_EN_PAD_FORCE_M  (RTCADC_SAR2_EN_PAD_FORCE_V << RTCADC_SAR2_EN_PAD_FORCE_S)
#define RTCADC_SAR2_EN_PAD_FORCE_V  0x00000001U
#define RTCADC_SAR2_EN_PAD_FORCE_S  31

/** RTCADC_MEAS2_MUX_REG register
 *  SAR ADC2 MUX register.
 */
#define RTCADC_MEAS2_MUX_REG (DR_REG_LP_ADC_BASE + 0x34)
/** RTCADC_SAR2_PWDET_CCT : R/W; bitpos: [30:28]; default: 0;
 *  SAR2_PWDET_CCT.
 */
#define RTCADC_SAR2_PWDET_CCT    0x00000007U
#define RTCADC_SAR2_PWDET_CCT_M  (RTCADC_SAR2_PWDET_CCT_V << RTCADC_SAR2_PWDET_CCT_S)
#define RTCADC_SAR2_PWDET_CCT_V  0x00000007U
#define RTCADC_SAR2_PWDET_CCT_S  28
/** RTCADC_SAR2_RTC_FORCE : R/W; bitpos: [31]; default: 0;
 *  In sleep, force to use rtc to control ADC.
 */
#define RTCADC_SAR2_RTC_FORCE    (BIT(31))
#define RTCADC_SAR2_RTC_FORCE_M  (RTCADC_SAR2_RTC_FORCE_V << RTCADC_SAR2_RTC_FORCE_S)
#define RTCADC_SAR2_RTC_FORCE_V  0x00000001U
#define RTCADC_SAR2_RTC_FORCE_S  31

/** RTCADC_ATTEN2_REG register
 *  ADC1 attenuation registers.
 */
#define RTCADC_ATTEN2_REG (DR_REG_LP_ADC_BASE + 0x38)
/** RTCADC_SAR2_ATTEN : R/W; bitpos: [31:0]; default: 4294967295;
 *  2-bit attenuation for each pad.
 */
#define RTCADC_SAR2_ATTEN    0xFFFFFFFFU
#define RTCADC_SAR2_ATTEN_M  (RTCADC_SAR2_ATTEN_V << RTCADC_SAR2_ATTEN_S)
#define RTCADC_SAR2_ATTEN_V  0xFFFFFFFFU
#define RTCADC_SAR2_ATTEN_S  0

/** RTCADC_FORCE_WPD_SAR_REG register
 *  In sleep, force to use rtc to control ADC
 */
#define RTCADC_FORCE_WPD_SAR_REG (DR_REG_LP_ADC_BASE + 0x3c)
/** RTCADC_FORCE_XPD_SAR1 : R/W; bitpos: [1:0]; default: 0;
 *  2'b11:software control, force on. 2'b10:software control, force off. 2'b0x:hardware
 *  control.
 */
#define RTCADC_FORCE_XPD_SAR1    0x00000003U
#define RTCADC_FORCE_XPD_SAR1_M  (RTCADC_FORCE_XPD_SAR1_V << RTCADC_FORCE_XPD_SAR1_S)
#define RTCADC_FORCE_XPD_SAR1_V  0x00000003U
#define RTCADC_FORCE_XPD_SAR1_S  0
/** RTCADC_FORCE_XPD_SAR2 : R/W; bitpos: [3:2]; default: 0;
 *  2'b11:software control, force on. 2'b10:software control, force off. 2'b0x:hardware
 *  control.
 */
#define RTCADC_FORCE_XPD_SAR2    0x00000003U
#define RTCADC_FORCE_XPD_SAR2_M  (RTCADC_FORCE_XPD_SAR2_V << RTCADC_FORCE_XPD_SAR2_S)
#define RTCADC_FORCE_XPD_SAR2_V  0x00000003U
#define RTCADC_FORCE_XPD_SAR2_S  2

/** RTCADC_COCPU_INT_RAW_REG register
 *  Interrupt raw registers.
 */
#define RTCADC_COCPU_INT_RAW_REG (DR_REG_LP_ADC_BASE + 0x48)
/** RTCADC_COCPU_SARADC1_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, int raw.
 */
#define RTCADC_COCPU_SARADC1_INT_RAW    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_RAW_M  (RTCADC_COCPU_SARADC1_INT_RAW_V << RTCADC_COCPU_SARADC1_INT_RAW_S)
#define RTCADC_COCPU_SARADC1_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_RAW_S  0
/** RTCADC_COCPU_SARADC2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, int raw.
 */
#define RTCADC_COCPU_SARADC2_INT_RAW    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_RAW_M  (RTCADC_COCPU_SARADC2_INT_RAW_V << RTCADC_COCPU_SARADC2_INT_RAW_S)
#define RTCADC_COCPU_SARADC2_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_RAW_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  An error occurs from ADC1, int raw.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_RAW    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_RAW_M  (RTCADC_COCPU_SARADC1_ERROR_INT_RAW_V << RTCADC_COCPU_SARADC1_ERROR_INT_RAW_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_RAW_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  An error occurs from ADC2, int raw.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_RAW    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_RAW_M  (RTCADC_COCPU_SARADC2_ERROR_INT_RAW_V << RTCADC_COCPU_SARADC2_ERROR_INT_RAW_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_RAW_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, int raw.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_RAW    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_RAW_M  (RTCADC_COCPU_SARADC1_WAKE_INT_RAW_V << RTCADC_COCPU_SARADC1_WAKE_INT_RAW_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_RAW_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, int raw.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_RAW    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_RAW_M  (RTCADC_COCPU_SARADC2_WAKE_INT_RAW_V << RTCADC_COCPU_SARADC2_WAKE_INT_RAW_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_RAW_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_RAW_S  5

/** RTCADC_INT_ENA_REG register
 *  Interrupt enable registers.
 */
#define RTCADC_INT_ENA_REG (DR_REG_LP_ADC_BASE + 0x4c)
/** RTCADC_COCPU_SARADC1_INT_ENA : R/WTC; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, int enable.
 */
#define RTCADC_COCPU_SARADC1_INT_ENA    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_ENA_M  (RTCADC_COCPU_SARADC1_INT_ENA_V << RTCADC_COCPU_SARADC1_INT_ENA_S)
#define RTCADC_COCPU_SARADC1_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_ENA_S  0
/** RTCADC_COCPU_SARADC2_INT_ENA : R/WTC; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, int enable.
 */
#define RTCADC_COCPU_SARADC2_INT_ENA    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_ENA_M  (RTCADC_COCPU_SARADC2_INT_ENA_V << RTCADC_COCPU_SARADC2_INT_ENA_S)
#define RTCADC_COCPU_SARADC2_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_ENA_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_ENA : R/WTC; bitpos: [2]; default: 0;
 *  An error occurs from ADC1, int enable.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_M  (RTCADC_COCPU_SARADC1_ERROR_INT_ENA_V << RTCADC_COCPU_SARADC1_ERROR_INT_ENA_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_ENA_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_ENA : R/WTC; bitpos: [3]; default: 0;
 *  An error occurs from ADC2, int enable.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_M  (RTCADC_COCPU_SARADC2_ERROR_INT_ENA_V << RTCADC_COCPU_SARADC2_ERROR_INT_ENA_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_ENA_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_ENA : R/WTC; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, int enable.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_M  (RTCADC_COCPU_SARADC1_WAKE_INT_ENA_V << RTCADC_COCPU_SARADC1_WAKE_INT_ENA_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_ENA_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_ENA : R/WTC; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, int enable.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_M  (RTCADC_COCPU_SARADC2_WAKE_INT_ENA_V << RTCADC_COCPU_SARADC2_WAKE_INT_ENA_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_ENA_S  5

/** RTCADC_INT_ST_REG register
 *  Interrupt status registers.
 */
#define RTCADC_INT_ST_REG (DR_REG_LP_ADC_BASE + 0x50)
/** RTCADC_COCPU_SARADC1_INT_ST : RO; bitpos: [0]; default: 0;
 *  ADC1 Conversion is done, int status.
 */
#define RTCADC_COCPU_SARADC1_INT_ST    (BIT(0))
#define RTCADC_COCPU_SARADC1_INT_ST_M  (RTCADC_COCPU_SARADC1_INT_ST_V << RTCADC_COCPU_SARADC1_INT_ST_S)
#define RTCADC_COCPU_SARADC1_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC1_INT_ST_S  0
/** RTCADC_COCPU_SARADC2_INT_ST : RO; bitpos: [1]; default: 0;
 *  ADC2 Conversion is done, int status.
 */
#define RTCADC_COCPU_SARADC2_INT_ST    (BIT(1))
#define RTCADC_COCPU_SARADC2_INT_ST_M  (RTCADC_COCPU_SARADC2_INT_ST_V << RTCADC_COCPU_SARADC2_INT_ST_S)
#define RTCADC_COCPU_SARADC2_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC2_INT_ST_S  1
/** RTCADC_COCPU_SARADC1_ERROR_INT_ST : RO; bitpos: [2]; default: 0;
 *  An error occurs from ADC1, int status.
 */
#define RTCADC_COCPU_SARADC1_ERROR_INT_ST    (BIT(2))
#define RTCADC_COCPU_SARADC1_ERROR_INT_ST_M  (RTCADC_COCPU_SARADC1_ERROR_INT_ST_V << RTCADC_COCPU_SARADC1_ERROR_INT_ST_S)
#define RTCADC_COCPU_SARADC1_ERROR_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC1_ERROR_INT_ST_S  2
/** RTCADC_COCPU_SARADC2_ERROR_INT_ST : RO; bitpos: [3]; default: 0;
 *  An error occurs from ADC2, int status.
 */
#define RTCADC_COCPU_SARADC2_ERROR_INT_ST    (BIT(3))
#define RTCADC_COCPU_SARADC2_ERROR_INT_ST_M  (RTCADC_COCPU_SARADC2_ERROR_INT_ST_V << RTCADC_COCPU_SARADC2_ERROR_INT_ST_S)
#define RTCADC_COCPU_SARADC2_ERROR_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC2_ERROR_INT_ST_S  3
/** RTCADC_COCPU_SARADC1_WAKE_INT_ST : RO; bitpos: [4]; default: 0;
 *  A wakeup event is triggered from ADC1, int status.
 */
#define RTCADC_COCPU_SARADC1_WAKE_INT_ST    (BIT(4))
#define RTCADC_COCPU_SARADC1_WAKE_INT_ST_M  (RTCADC_COCPU_SARADC1_WAKE_INT_ST_V << RTCADC_COCPU_SARADC1_WAKE_INT_ST_S)
#define RTCADC_COCPU_SARADC1_WAKE_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC1_WAKE_INT_ST_S  4
/** RTCADC_COCPU_SARADC2_WAKE_INT_ST : RO; bitpos: [5]; default: 0;
 *  A wakeup event is triggered from ADC2, int status.
 */
#define RTCADC_COCPU_SARADC2_WAKE_INT_ST    (BIT(5))
#define RTCADC_COCPU_SARADC2_WAKE_INT_ST_M  (RTCADC_COCPU_SARADC2_WAKE_INT_ST_V << RTCADC_COCPU_SARADC2_WAKE_INT_ST_S)
#define RTCADC_COCPU_SARADC2_WAKE_INT_ST_V  0x00000001U
#define RTCADC_COCPU_SARADC2_WAKE_INT_ST_S  5

