espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_adc_reg.h
/** RTCADC_WAKEUP2_REG register
 *  ADC2 wakeup configuration registers.
 */
#define RTCADC_WAKEUP2_REG (DR_REG_LP_ADC_BASE + 0x64)
/** RTCADC_SAR2_WAKEUP_TH_LOW : R/W; bitpos: [11:0]; default: 0;
 *  Lower threshold.
 */
#define RTCADC_SAR2_WAKEUP_TH_LOW    0x00000FFFU
#define RTCADC_SAR2_WAKEUP_TH_LOW_M  (RTCADC_SAR2_WAKEUP_TH_LOW_V << RTCADC_SAR2_WAKEUP_TH_LOW_S)
#define RTCADC_SAR2_WAKEUP_TH_LOW_V  0x00000FFFU
#define RTCADC_SAR2_WAKEUP_TH_LOW_S  0
/** RTCADC_SAR2_WAKEUP_TH_HIGH : R/W; bitpos: [25:14]; default: 4095;
 *  Upper threshold.
 */
#define RTCADC_SAR2_WAKEUP_TH_HIGH    0x00000FFFU
#define RTCADC_SAR2_WAKEUP_TH_HIGH_M  (RTCADC_SAR2_WAKEUP_TH_HIGH_V << RTCADC_SAR2_WAKEUP_TH_HIGH_S)
#define RTCADC_SAR2_WAKEUP_TH_HIGH_V  0x00000FFFU
#define RTCADC_SAR2_WAKEUP_TH_HIGH_S  14
/** RTCADC_SAR2_WAKEUP_OVER_UPPER_TH : RO; bitpos: [29]; default: 0;
 *  Indicates that this wakeup event arose from exceeding upper threshold.
 */
#define RTCADC_SAR2_WAKEUP_OVER_UPPER_TH    (BIT(29))
#define RTCADC_SAR2_WAKEUP_OVER_UPPER_TH_M  (RTCADC_SAR2_WAKEUP_OVER_UPPER_TH_V << RTCADC_SAR2_WAKEUP_OVER_UPPER_TH_S)
#define RTCADC_SAR2_WAKEUP_OVER_UPPER_TH_V  0x00000001U
#define RTCADC_SAR2_WAKEUP_OVER_UPPER_TH_S  29
/** RTCADC_SAR2_WAKEUP_EN : R/W; bitpos: [30]; default: 0;
 *  Wakeup function enable.
 */
#define RTCADC_SAR2_WAKEUP_EN    (BIT(30))
#define RTCADC_SAR2_WAKEUP_EN_M  (RTCADC_SAR2_WAKEUP_EN_V << RTCADC_SAR2_WAKEUP_EN_S)
#define RTCADC_SAR2_WAKEUP_EN_V  0x00000001U
#define RTCADC_SAR2_WAKEUP_EN_S  30
/** RTCADC_SAR2_WAKEUP_MODE : R/W; bitpos: [31]; default: 0;
 *  0:absolute value comparison mode. 1: relative value comparison mode.
 */
#define RTCADC_SAR2_WAKEUP_MODE    (BIT(31))
#define RTCADC_SAR2_WAKEUP_MODE_M  (RTCADC_SAR2_WAKEUP_MODE_V << RTCADC_SAR2_WAKEUP_MODE_S)
#define RTCADC_SAR2_WAKEUP_MODE_V  0x00000001U
#define RTCADC_SAR2_WAKEUP_MODE_S  31

/** RTCADC_WAKEUP_SEL_REG register
 *  Wakeup source select register.
 */
#define RTCADC_WAKEUP_SEL_REG (DR_REG_LP_ADC_BASE + 0x68)
/** RTCADC_SAR_WAKEUP_SEL : R/W; bitpos: [0]; default: 0;
 *  0: ADC1. 1: ADC2.
 */
#define RTCADC_SAR_WAKEUP_SEL    (BIT(0))
#define RTCADC_SAR_WAKEUP_SEL_M  (RTCADC_SAR_WAKEUP_SEL_V << RTCADC_SAR_WAKEUP_SEL_S)
#define RTCADC_SAR_WAKEUP_SEL_V  0x00000001U
#define RTCADC_SAR_WAKEUP_SEL_S  0

/** RTCADC_SAR1_HW_WAKEUP_REG register
 *  Hardware automatic sampling registers for wakeup function.
 */
#define RTCADC_SAR1_HW_WAKEUP_REG (DR_REG_LP_ADC_BASE + 0x6c)
/** RTCADC_ADC1_HW_READ_EN_I : R/W; bitpos: [0]; default: 0;
 *  Enable hardware automatic sampling.
 */
#define RTCADC_ADC1_HW_READ_EN_I    (BIT(0))
#define RTCADC_ADC1_HW_READ_EN_I_M  (RTCADC_ADC1_HW_READ_EN_I_V << RTCADC_ADC1_HW_READ_EN_I_S)
#define RTCADC_ADC1_HW_READ_EN_I_V  0x00000001U
#define RTCADC_ADC1_HW_READ_EN_I_S  0
/** RTCADC_ADC1_HW_READ_RATE_I : R/W; bitpos: [16:1]; default: 100;
 *  Hardware automatic sampling rate.
 */
#define RTCADC_ADC1_HW_READ_RATE_I    0x0000FFFFU
#define RTCADC_ADC1_HW_READ_RATE_I_M  (RTCADC_ADC1_HW_READ_RATE_I_V << RTCADC_ADC1_HW_READ_RATE_I_S)
#define RTCADC_ADC1_HW_READ_RATE_I_V  0x0000FFFFU
#define RTCADC_ADC1_HW_READ_RATE_I_S  1

/** RTCADC_SAR2_HW_WAKEUP_REG register
 *  Hardware automatic sampling registers for wakeup function.
 */
#define RTCADC_SAR2_HW_WAKEUP_REG (DR_REG_LP_ADC_BASE + 0x70)
/** RTCADC_ADC2_HW_READ_EN_I : R/W; bitpos: [0]; default: 0;
 *  Enable hardware automatic sampling.
 */
#define RTCADC_ADC2_HW_READ_EN_I    (BIT(0))
#define RTCADC_ADC2_HW_READ_EN_I_M  (RTCADC_ADC2_HW_READ_EN_I_V << RTCADC_ADC2_HW_READ_EN_I_S)
#define RTCADC_ADC2_HW_READ_EN_I_V  0x00000001U
#define RTCADC_ADC2_HW_READ_EN_I_S  0
/** RTCADC_ADC2_HW_READ_RATE_I : R/W; bitpos: [16:1]; default: 100;
 *  Hardware automatic sampling rate.
 */
#define RTCADC_ADC2_HW_READ_RATE_I    0x0000FFFFU
#define RTCADC_ADC2_HW_READ_RATE_I_M  (RTCADC_ADC2_HW_READ_RATE_I_V << RTCADC_ADC2_HW_READ_RATE_I_S)
#define RTCADC_ADC2_HW_READ_RATE_I_V  0x0000FFFFU
#define RTCADC_ADC2_HW_READ_RATE_I_S  1

#ifdef __cplusplus
}
#endif
